{
  "search_data": [
    {
      "date": "2025-07-01",
      "keyword": "Tesla",
      "tweets": [
        " BREAKING: FSD Transfer now seems possible in EUROPE! When buying a new Tesla, you can reportedly transfer FSD from your old vehicle, saving €7,500!\n\nNote: This info is based on user reports and not officially confirmed.",
        "Tesla has officially launched its Model Y electric vehicle in India, opening its first showroom in Mumbai today. Maharashtra Chief Minister Devendra Fadnavis attended the inauguration, inviting Tesla to establish research and development and manufacturing facilities in the state.",
        " NEW VIDEO OUT \n\nNo EV Tax Credits…No problem  \nEV vs ICE 63% Cheaper TCO  \nEV’s still the smart financial choice! \n\nEnjoy ",
        "If you want one of my Tesla phones?\n\nGive me a Thumb-Up  or say yes and Let me know",
        "Breaking: Dragon \n@SpaceX\n just passed by our house in Northern California. That was the most beautiful sight I have ever seen in the sky.",
        "New Tesla Supercharger: New Italy, NSW, Australia (12 stalls) \nhttps://tesla.com/findus?location=31617…",
        "Buyers of new EVs priced under £37,000 to get discount of up to 10%\n\nGovernment's new £650m EV grant scheme will offer discount of up to £3,750 for the “greenest” vehicles based on sustainability criteria\n\nWe're waiting details of these criteria"
      ]
    },
    {
      "date": "2025-07-01",
      "keyword": "Google",
      "tweets": [
        "Joe Rogan: When things pops off in the world I go to Google and nothings there. Then I go to X and there’s info there immediately… Info is on X before anywhere else.",
        "Google keeps working on adding new features to NotebookLM for learning. \n\nIn addition to earlier spotted Flashcards, the Notebook Apps section now also contains a Quiz option. \n\n\"Generate an AI interactive quiz based on your sources\" \n\n* Not available yet",
        "Our new number 28 \n\nShot on Google Pixel ",
        "Madhav Sheth Launches New Brand: Ai+\n\nA new Made-in-India smartphone brand is here — Ai+, powered by NxtQuantum OS\n\nKey Features:\n\nNxtPrivacy Dashboard for data control\nSecure vault (NxtSpace)\nGoogle Cloud India data storage\n\nTwo Phones:\n\nPulse – 6.75” HD+ 90Hz, 50MP dual AI cam,",
        " A new Chrome zero-day is already being exploited in the wild.\n\nDiscovered by Google TAG on June 25, CVE-2025-6554 lets attackers run malicious code via a crafted web page.\n\nIt targets Chrome’s V8 engine—again.\n\nUpdate now →",
        "BREAKING: Meta, OpenAI, Anthropic, and Google have signed Soham Parekh as fractional Chief AI Officer"
      ]
    },
    {
      "date": "2025-07-01",
      "keyword": "Nvidia",
      "tweets": [
        "BREAKING: The chipmaker Nvidia surpassed $4 trillion in market valuation, the first company ever to do so.",
        " Boltz-2 is the new open source AI model from \n@MIT\n and \n@RecursionPharma\n.\n\nDid you know it's capable of predicting protein binding affinity with unprecedented speed, scale, and accuracy? \n\n#NVIDIABioNeMo #Boltz2 #DrugDiscovery",
        "Whoa!\n@OpenAI\n just dropped a $30B bombshell with \n@Oracle\n , ditching some Microsoft/Nvidia ties for a wild new ride!\nSolidus \n@AITECHio\n believes this mega-deal could shake up the AI game, giving OpenAI flex and Oracle a shot at the big leagues.\nLet's go guys!\n#AITECH #ChannelsTV",
        "14JULY2025 — NASDAQ FUTURES POP — NVIDIA to Resume H20 Sales in China, Unveils New Fully Compliant GPU for Chinese Market”\n\n#interceptornews\nCredit \n@Beth_Kindig",
        "Breaking News: The A.I. chip maker Nvidia became the first U.S. company worth more than $4 trillion, beating Apple and Microsoft to the milestone.",
        "Exciting news from \n@Bybit_Official\n and \n@xStocksFi\n! \n\nOn June 30, 2025, Bybit announced the listing of xStocks; tokenized U.S. equities like Apple, Tesla, and Nvidia, on its platform. \n\nThis partnership aims to bridge traditional finance with blockchain, offering global investors"
      ]
    },
    {
      "date": "2025-07-01",
      "keyword": "Apple",
      "tweets": [
        "BNXN's \"Captain\" hits a new peak of #3 on UK Apple Music Top Albums chart. \n\nIt becomes his highest charting project in the region. ",
        " Apple Music México.\n\n#176. “AyMami” — \n@DannOcean\n y \n@KeniaOs\n [+8] *NEW PEAK*",
        " Burna Boy's \"No Sign of Weakness\" climbs to a new peak of #3 on the NG Apple Top Albums Chart ",
        "The Apple Watch gets a lot of attention.  Why?\n\nLet's talk about what it can and can't do for your heart.  Medical professionals and patients, see below for the ACC Apple Watch Guide. As always, this is not medical advice.\n\nFor those who are new to digital health, here's an",
        "Apple Music Türkiye  - Top Albums\n\n#1 - THIS IS FOR *NEW ENTRY* \n\n1st #1*",
        "Apple Music USA - Top Albums :\n\n#1.KPop Demon Hunters (+1)  *NEW PEAK*\n\n— \n@JYPETWICE\n, Huntrix, Saja Boys, and KPop Demon Hunters cast FIRST-EVER #1 hit on the country! ",
        "A New Episode of Beyond The Lens is Live             \n\n93. Brooks Jensen: The Making Of LensWork, Lessons In Finding Your Photographic Voice, Creative Constraints, And Seeing In Sixes\n\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/beyond-the-lens-with-richard-bernabe/id1613598927?i=1000716051112…",
        "Apple Music Japan :\n\n#17. THIS IS FOR (+1) *NEW PEAK*\n#154. OPTIONS\n#185. MARS"
      ]
    },
    {
      "date": "2025-07-01",
      "keyword": "Microsoft",
      "tweets": [
        "Read more about Microsoft's layoff and replace model ",
        " BIG BREAKING\n\nMicrosoft SUSPENDS all operations in Pakistan \n\n— Even tech giants can’t survive in Bhikaristan.",
        "BREAKING:\n\n Microsoft is laying off 9,000 employees but has already requested 14,181 new H-1B visa workers so far this year - CBS News",
        " Chinese national arrested in Italy for role in massive U.S. cyber espionage campaign.\n\nXu Zewei allegedly hacked vaccine research & 12,700+ victims using Microsoft Exchange zero-days—linked to China's state-backed Silk Typhoon group.\n\nDetails here →",
        "National security experts raise concerns after Microsoft program exposed as possible avenue for Chinese spying",
        "BREAKING: New UN Report Names and Shames Firms Profiting from Israel’s Genocide\n\nA new report by UN Special Rapporteur Francesca Albanese \n@FranceskAlbs\n investigates companies complicit in Israel’s genocide in Palestine, including major U.S. firms: Microsoft, Google’s parent",
        "This French city has said no to Microsoft."
      ]
    }
  ]
}